---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingHeightShiftType
source: html/9b32099b-96f0-3747-e9df-44e1f95c8f41.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingHeightShiftType Property

"Use Landing Height Adjustment"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingHeightShiftType { get; }
```